In [7]:
import pandas as pd

df = pd.read_csv('./data/top_movies_cleaned.csv') # read csv file

Create a DataFrame for the table in SQL with the cast id, name and gender:

In [8]:
df_act = pd.read_csv('./data/raw/API_cast_gender.csv') # read csv file
df_dir = pd.read_csv('./data/raw/API_dir_gender.csv') # read csv file

In [9]:
df_act['person_gender'] = df_act['person_gender'].replace({'Hombre': 'M', 'Mujer': 'F'})

In [10]:
df_act.rename(columns={'person_id': 'actor_id', 'person_name': 'actor_name', 'person_gender': 'actor_gender'}, inplace=True)

In [11]:
df_act.sample(10)

      actor_id        actor_name actor_gender
971        972        Emma Stone            F
1229      1230        Helen Hunt            F
3031      3032    Susan Sarandon            F
1206      1207  Harris Dickinson            M
3265      3266        Will Smith            M
70          71     Alec Guinness            M
1509      1510     Jill St. John            F
1932      1933      Lee Tergesen            M
1587      1588    John Krasinski            M
1296      1297      Isaiah Stone            M

Create a DataFrame for the table in SQL with the director id, name and gender:

In [12]:
df_dir['person_gender'] = df_dir['person_gender'].replace({'Hombre': 'M', 'Mujer': 'F'})

In [13]:
df_dir.rename(columns={'person_id': 'director_id', 'person_name': 'director_name', 'person_gender': 'director_gender'}, inplace=True)

In [14]:
df_dir.sample(5)

     director_id    director_name director_gender
876          877  Tomas Alfredson               M
242          243       Eric Appel               M
586          587     Michael Mann               M
275          276      Gary Winick               M
192          193    David Fincher               M

In [15]:
df_dir['director_gender'].replace('Lasse Hallström', 'M', inplace=True)

C:\Users\almuo\AppData\Local\Temp\ipykernel_21816\2019781165.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_dir['director_gender'].replace('Lasse Hallström', 'M', inplace=True)

In [16]:
df_dir['director_gender'].replace('nan', 'N', inplace = True)

C:\Users\almuo\AppData\Local\Temp\ipykernel_21816\211977993.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_dir['director_gender'].replace('nan', 'N', inplace = True)

Create he dataframe to the genres table, with the id and genre name:

In [17]:
import ast
df['genre'] = df['genre'].apply(lambda x: ast.literal_eval(x) if isinstance(x, str) else x)

In [18]:
all_genres = [genre for sublist in df['genre'] for genre in sublist]

unique_genres = pd.unique(all_genres)

genres_df = pd.DataFrame(unique_genres, columns=['genre_name'])

C:\Users\almuo\AppData\Local\Temp\ipykernel_21816\3372808026.py:3: FutureWarning: unique with argument that is not not a Series, Index, ExtensionArray, or np.ndarray is deprecated and will raise in a future version.
  unique_genres = pd.unique(all_genres)

In [19]:
genres_df['genre_id'] = genres_df.index + 1

In [20]:
genres_df.head(10)

  genre_name  genre_id
0      Drama         1
1    Mystery         2
2   Thriller         3
3  Adventure         4
4     Comedy         5
5     Family         6
6    Romance         7
7      Crime         8
8    History         9
9     Action        10

Create the dataframe for 'movies'table with all the basic information with 'movie_id', 'title', 'rating', 'meta_score', 'year', 'revenue', 'director_id'

In [21]:
# Make a copy of the dataframe to avoid modifying the original data
movies_df = df[['title', 'rating', 'meta_score', 'year', 'revenue', 'director']].copy()

In [22]:
#Add the movie_id column
movies_df['movie_id'] = movies_df.index + 1

In [23]:
# Translate the director's name to director_id
movies_df = movies_df.merge(df_dir[['director_id', 'director_name']], left_on='director', right_on='director_name', how='left')

In [24]:
#Select only the columns we need
movies_df = movies_df[['movie_id', 'title', 'rating', 'meta_score', 'year', 'revenue', 'director_id']]

In [25]:
movies_df.sample(10)

,movie_id,title,rating,meta_score,year,revenue,director_id
1173,1174,the great outdoors,6.6,24.0,1988,43455230,327.0
1469,1470,crocodile dundee ii,5.7,41.0,1988,239606210,415.0
1189,1190,sense and sensibility,7.7,84.0,1995,134582776,51.0
301,302,the deer hunter,8.1,86.0,1978,49000000,575.0
996,997,hannibal,6.8,57.0,2001,351692268,717.0
1224,1225,riddick,6.4,49.0,2013,98337295,208.0
867,868,the last of the mohicans,7.7,76.0,1992,75505856,587.0
941,942,venom let there be carnage,5.9,49.0,2021,506863592,48.0
362,363,black adam,6.2,41.0,2022,393252111,368.0
781,782,starship troopers,7.3,52.0,1997,121214377,663.0

Create dataframe for cast table with 'movie_id' and 'person_id':

In [26]:
df['cast'] = df['cast'].apply(lambda x: ast.literal_eval(x) if isinstance(x, str) else x)

In [27]:
cast_df = df.merge(movies_df[['movie_id', 'title']], how='left', left_on='title', right_on='title')

In [28]:
cast_df = cast_df[['movie_id', 'cast']].explode('cast').rename(columns={'cast': 'actor_name'})

In [29]:
cast_df = cast_df.merge(df_act, how='left', left_on='actor_name', right_on='actor_name')

In [30]:
cast_df = cast_df[['movie_id', 'actor_id']]

In [31]:
cast_df.head(10)

   movie_id  actor_id
0         1      1707
1         1      2081
2         1      1004
3         1      2355
4         2      3120
5         2      1180
6         2      2354
7         2      2520
8         3       972
9         3      2135

In [32]:
cast_df = cast_df.drop_duplicates(subset=['movie_id', 'actor_id'])

Create a dataframe wich relates movies_id and genres_id

In [33]:
df['genre'] = df['genre'].apply(lambda x: ast.literal_eval(x) if isinstance(x, str) else x)

movies_genres_df = df.merge(movies_df[['movie_id', 'title']], how='left', left_on='title', right_on='title')

movies_genres_df = movies_genres_df[['movie_id', 'genre']].explode('genre').rename(columns={'genre': 'genre_name'})

movies_genres_df = movies_genres_df.merge(genres_df, how='left', left_on='genre_name', right_on='genre_name')

movies_genres_df = movies_genres_df[['movie_id', 'genre_id']]

In [34]:
movies_genres_df.head(10)

   movie_id  genre_id
0         1         1
1         1         2
2         1         3
3         2         4
4         2         5
5         2         6
6         3         5
7         3         1
8         3         7
9         4         8

In [35]:
movies_genres_df = movies_genres_df.drop_duplicates(subset=['movie_id', 'genre_id'])

# TO SQL

In [34]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql

In [35]:
from dotenv import load_dotenv
import os

load_dotenv()

password = os.getenv('password')

# Tus parámetros de conexión
bd = "top_movies"
connection_string = f'mysql+pymysql://root:{password}@localhost/{bd}'
engine = create_engine(connection_string)

In [61]:
dataframes = {
    "actors": df_act,
    "directors": df_dir,
    "genres": genres_df,
    "movies": movies_df,
    "cast": cast_df,
    "movies_genres": movies_genres_df
}

In [62]:
# Sent each DataFrame to the database
for table_name, df in dataframes.items():
    df.to_sql(table_name, con=engine, if_exists='append', index=False)
    print(f"Datos insertados en la tabla {table_name}")

Datos insertados en la tabla cast
Datos insertados en la tabla movies_genres